[
  {
    "text": "Javascript, Python, Typescript, HTML, CSS, SQL",
    "page": 1,
    "x": 86,
    "y": 100,
    "width": 198,
    "height": 10,
    "description": "Strong: This demonstrates proficiency in languages requested in the job description (Python) and others commonly used in web development. The Amazon job specifically mentions Java, C++, C#, Python, NodeJS, or Ruby as desirable. This candidate has Python and Javascript, which are beneficial.",
    "type": "strong"
  },
  {
    "text": "Cloud Platforms (AWS, GCP, Azure), Docker, Regex, Heroku, Git, Kubernetes, Terraform, Agile Project Management, CI/CD",
    "page": 1,
    "x": 79,
    "y": 138,
    "width": 496,
    "height": 10,
    "description": "Strong: Experience with cloud platforms like AWS, GCP, and Azure is highly valuable, especially given Amazon's emphasis on cloud systems and potentially using AWS. Docker, Kubernetes, Terraform and CI/CD showcase DevOps knowledge.",
    "type": "strong"
  },
  {
    "text": "Software Engineer",
    "page": 1,
    "x": 76,
    "y": 176,
    "width": 79,
    "height": 10,
    "description": "Strong: The candidate has recent experience as a Software Engineer at Arize AI, which is directly relevant to the target role.",
    "type": "strong"
  },
  {
    "text": "Proficiently orchestrate cloud resource management across AWS, GCP, and Azure, ensuring high availability.",
    "page": 1,
    "x": 72,
    "y": 189,
    "width": 434,
    "height": 10,
    "description": "Strong: This bullet point highlights practical experience in cloud resource management, a key skill for many software engineering roles, particularly at Amazon where they 'engineer for high availability'.",
    "type": "strong"
  },
  {
    "text": "Bachelor of Science in Computer Science: Object-Oriented Programming,",
    "page": 1,
    "x": 258,
    "y": 712,
    "width": 298,
    "height": 10,
    "description": "Strong: A Bachelor's degree in Computer Science fulfills one of the basic qualifications listed in the Amazon job description.",
    "type": "strong"
  },
  {
    "text": "Freelance",
    "page": 1,
    "x": 36,
    "y": 265,
    "width": 42,
    "height": 10,
    "description": "Weak: While experience as a freelance developer is valuable, it lacks the specificity and impact demonstrated in the other roles. This section could be improved by providing more context about the size and scope of the projects, the technologies used, and the quantifiable results achieved.",
    "type": "weak"
  },
  {
    "text": "Optimized release pipelines, guaranteeing peak platform health, performance, and reliability for on-premises customers.",
    "page": 1,
    "x": 72,
    "y": 202,
    "width": 471,
    "height": 10,
    "description": "Weak: While platform health, performance and reliability are important, this bullet point focuses on *on-premises* customers, which is becoming less relevant as companies shift to cloud-native architectures. The candidate should show that they can orchestrate health, reliability, and performance with cloud infrastructure, such as demonstrating cloud native skills like using Lambda functions, or SQS queues.",
    "type": "weak"
  },
  {
    "text": "App Academy,",
    "page": 1,
    "x": 36,
    "y": 699,
    "width": 61,
    "height": 10,
    "description": "Weak: While a Full Stack Software Engineer certification from App Academy is good for a new graduate, it is not an equivalent qualification to a Bachelor's or Master's degree in Computer Science and it could be perceived as lacking the theoretical depth desired by an employer such as Amazon.",
    "type": "weak"
  },
  {
    "text": "Ourbucks",
    "page": 1,
    "x": 36,
    "y": 342,
    "width": 42,
    "height": 10,
    "description": "Weak: While describing the technologies used is useful (React.js, Redux, Python, etc.), there's no quantifiable impact for this project, or the others. How many users did it have? What problems did it solve? Without context, the projects lack impact.",
    "type": "weak"
  },
  {
    "text": "Sales Support Representative - Inside Sales",
    "page": 1,
    "x": 93,
    "y": 622,
    "width": 179,
    "height": 10,
    "description": "Weak: The sales role is not directly related to software engineering. While skills gained in sales (communication, problem-solving) can be transferable, the emphasis should be on highlighting technical skills and experiences. This should be shortened, unless the transferable skills are explicitly linked to software development.",
    "type": "weak"
  }
]