[
  {
    "text": "Data Visualization and Business Intelligence",
    "page": 1,
    "x": 107,
    "y": 217,
    "width": 184,
    "height": 12,
    "description": "This course work is strong because it directly relates to the analytical skills needed for an account executive role, providing the candidate with a foundation in presenting data effectively.",
    "type": "strong"
  },
  {
    "text": "Financial Analysis of CVS Health Corp",
    "page": 1,
    "x": 72,
    "y": 307,
    "width": 176,
    "height": 12,
    "description": "This project is strong because it showcases the candidate's ability to conduct financial analysis, a valuable skill for understanding client needs and market trends in an account executive role.",
    "type": "strong"
  },
  {
    "text": "Utilized Excel and financial modeling to analyze data trends and performance indicators.",
    "page": 1,
    "x": 107,
    "y": 347,
    "width": 364,
    "height": 12,
    "description": "This bullet point is strong because it highlights the candidate's proficiency in Excel and financial modeling, essential tools for data analysis and performance tracking in an account executive position.",
    "type": "strong"
  },
  {
    "text": "Created interactive Tableau dashboards with visualizations to present key insights and trends in sales and",
    "page": 1,
    "x": 107,
    "y": 525,
    "width": 423,
    "height": 12,
    "description": "This bullet point is strong as proficiency in Tableau for creating interactive dashboards demonstrates the candidate's ability to communicate complex data insights in a visually appealing and understandable manner, important for presenting to clients as an account executive.",
    "type": "strong"
  },
  {
    "text": "VOLUNTEER EXPERIENCE",
    "page": 1,
    "x": 71,
    "y": 562,
    "width": 134,
    "height": 12,
    "description": "While volunteer experience is good, the description provided is very general. To improve, quantify achievements and relate them to skills required for the target role. For example, instead of 'Assist and provide general support,' try 'Provided support to over 100 employers, addressing their inquiries and facilitating connections with potential candidates, improving networking outcomes by X%'.",
    "type": "weak"
  },
  {
    "text": "SKILLS",
    "page": 1,
    "x": 72,
    "y": 676,
    "width": 37,
    "height": 12,
    "description": "The skills section, while listing technical skills, lacks specific details about the candidate's proficiency level in each skill. For the Account Executive role add Sales skills, Communication and Relationship building skills, and also Industry knowledge to showcase experience and expertise.",
    "type": "weak"
  },
  {
    "text": "Strategic Management",
    "page": 1,
    "x": 107,
    "y": 256,
    "width": 96,
    "height": 12,
    "description": "While Strategic Management is a relevant course, to improve the CV, the candidate should focus on quantifying the accomplishments by adding experience or projects to demonstrate the skill.",
    "type": "weak"
  }
]