[
  {
    "text": "Programming languages: C++, Python, JavaScript,\nTypeScript",
    "page": 1,
    "x": 21,
    "y": 388.05,
    "width": 311.2,
    "height": 27.48,
    "description": "This is a strong area because it highlights relevant programming languages. The job description mentions C# and .NET, which are missing here. While the candidate doesn't list C#, it's good that they know C++, Python, JavaScript and TypeScript, which demonstrate good programming foundation.",
    "type": "strong"
  },
  {
    "text": "Frameworks/Tools: Reactjs, TailwindCSS, Figma",
    "page": 1,
    "x": 21,
    "y": 414.45,
    "width": 298,
    "height": 15.74,
    "description": "This is a strong area because Reactjs and related web development tools show experience with modern web technologies which could be an asset if the company intends to incorporate new web-centric or mobile solutions.",
    "type": "strong"
  },
  {
    "text": "Google Developer Group - HCMUS Ho Chi Minh, Vietnam\nWeb Specialist Oct 2024 - Present",
    "page": 2,
    "x": 21,
    "y": 401.25,
    "width": 337.6,
    "height": 30.98,
    "description": "This is a strong area because it demonstrates involvement in a tech community, which indicates a proactive approach to learning and collaboration. Being a 'Web Specialist' suggests some level of expertise in web development, aligned with front-end tasks and tech-sharing workshops about web development.",
    "type": "strong"
  },
  {
    "text": "•\nMainly focused on Front End tasks for upcoming\nprojects liked building new websites for the club and\ntech-sharing\nworkshops about web developing.",
    "page": 2,
    "x": 21,
    "y": 427.65,
    "width": 350.8,
    "height": 70.74,
    "description": "This experience shows passion for the industry, along with relevant skills that are very desireable for companies that are looking for innovative employees. This position involves 'building new websites', which is beneficial as the job description mentions interfacing with third-party solutions.",
    "type": "strong"
  },
  {
    "text": "Health Recommendation System Ho Chi Minh, Vietnam\nFrontend Developer May 2024 – July 2024",
    "page": 1,
    "x": 21,
    "y": 440.85,
    "width": 324.4,
    "height": 30.98,
    "description": "This is a weak area because while it demonstrates project experience, it lacks specific details about the technologies used and the complexity of the project. It also lacks relevance to the job requirement of the Public Safety/Health domain. It should be improved by highlighting the technical challenges faced and how they were overcome. Showing the project is related to Public Safety/Health would greatly help.",
    "type": "weak"
  },
  {
    "text": "Linear\nAlgebra, Discrete Structures, Scientific Method.",
    "page": 1,
    "x": 21,
    "y": 242.85,
    "width": 317.8,
    "height": 28.98,
    "description": "This is a weak area. Mentioning coursework is good to show basic understanding. However, the courses are relatively basic for a Software Engineer I position. The candidate should highlight more advanced coursework or projects to demonstrate deeper knowledge of software development principles.",
    "type": "weak"
  },
  {
    "text": "TikTok TechJam 2024 Ho Chi Minh, Vietnam\nFrontend Developer Jun 2024 - July 2024",
    "page": 2,
    "x": 21,
    "y": 84.45,
    "width": 265,
    "height": 30.98,
    "description": "This is a weak area, while it demonstrates relevant experience in frontend development and mentions specific technologies (React, TailwindCSS), it still lacks quantification of results. What measurable impact did this project have? This project also has no relevance to the job description.",
    "type": "weak"
  },
  {
    "text": "SKILLS",
    "page": 1,
    "x": 21,
    "y": 374.85,
    "width": 40.6,
    "height": 15.74,
    "description": "This is a weak area. Skills need to be more specific and detailed. For example, instead of just listing 'JavaScript', the candidate should specify frameworks and libraries they are proficient in (e.g., React, Angular, Vue). The CV should include skills with database technologies such as Microsoft SQL Server (T-SQL), ODBC, SQL Reporting Services, and Microsoft Access.",
    "type": "weak"
  }
]