[
  {
    "text": "Bachelor of Science in Business Analytics",
    "page": 1,
    "x": 89.98,
    "y": 140.3,
    "width": 172.29,
    "height": 11.16,
    "description": "The job description requires a Bachelor’s degree in Computer Science or a related field. While Business Analytics might have some overlap, it's not a direct match. The candidate needs to highlight any computer science related skills or projects within the context of their Business Analytics degree and potentially mention a minor or relevant coursework in computer science if applicable."
  },
  {
    "text": "Technical skills:",
    "page": 1,
    "x": 107.25,
    "y": 692.54,
    "width": 65.14,
    "height": 11.16,
    "description": "The listed technical skills are generic. The job requires proficiency in at least one programming language (e.g., Python, Java, C++), experience with version control (e.g., Git), and experience with cloud platforms is a plus. While Python is listed, the candidate should explicitly mention their proficiency level (e.g., \"Proficient in Python\") and their experience with version control systems like Git. Including specific projects where they used Python and Git would be very helpful. AWS or Azure experience should also be highlighted if present."
  },
  {
    "text": "Python, SQL, Tableau, HTML, Microsoft Office (Word, Excel, Power Point), Orange",
    "page": 1,
    "x": 174.87,
    "y": 692.54,
    "width": 341.7,
    "height": 11.16,
    "description": "This list of technical skills is too broad and includes irrelevant software (Microsoft Office) for a Software Engineer position. Instead, the candidate should emphasize programming languages relevant to software development (like Python, Java, or C++), version control systems (Git), databases (SQL is good), and cloud technologies (AWS, Azure, etc.) if they have experience. Quantifying the experience with specific technologies would be beneficial (e.g. \"Python: 3 years of experience developing...\", \"Git: Proficient in using Git for version control and collaboration.\")"
  },
  {
    "text": "PROJECTS",
    "page": 1,
    "x": 72.73,
    "y": 294.38,
    "width": 57.25,
    "height": 11.16,
    "description": "The projects listed are related to business and finance, and while they showcase analytical skills, they don't demonstrate software development experience. To better match the Software Engineer role, the candidate needs to include personal software projects, contributions to open-source projects, or any coursework projects that involved coding and software development. These projects should highlight relevant programming languages, frameworks, and tools."
  }
]