[
  {
    "text": "Bachelor of Fine Arts, Major in Graphic Design,",
    "page": 1,
    "x": 41.28,
    "y": 143.17,
    "width": 203.1,
    "height": 12.31,
    "description": "This education is not directly aligned with the Software Engineer role. The job requires a Bachelor's degree in Computer Science or a related field. While a strong portfolio might compensate, the CV needs to highlight how the Graphic Design skills are transferable and beneficial to software development, or ideally, the candidate should pursue some relevant coursework/certifications."
  },
  {
    "text": "Software:",
    "page": 2,
    "x": 36,
    "y": 402.13,
    "width": 41.32,
    "height": 12.31,
    "description": "The listed software skills (Adobe Illustrator, Adobe Photoshop, Adobe InDesign, Adobe XD, Figma, Microsoft Office) are relevant to graphic design, but not directly applicable to a Software Engineer role. This section should include programming languages (Python, Java, C++, etc.), frameworks, libraries, and tools commonly used in software development. It lacks information about technologies relevant to the job description, like cloud platforms or version control systems (mentioned later, but not in this 'Software' section)."
  },
  {
    "text": "Soft skills:",
    "page": 2,
    "x": 36,
    "y": 414.37,
    "width": 44.28,
    "height": 12.31,
    "description": "While the listed soft skills (Time Management, Guest Experience, Hospitality, Leadership) are valuable, they aren't specifically tailored to a Software Engineer role. The candidate should include soft skills more relevant to software development, such as problem-solving, communication (especially technical communication), teamwork, and attention to detail. Although 'Time Management' can be useful in almost any job, it is best to place the most relevant skills first and include technical skills."
  },
  {
    "text": "PROJECTS",
    "page": 2,
    "x": 36,
    "y": 48.13,
    "width": 48.54,
    "height": 12.31,
    "description": "The projects listed are related to graphic design, not software engineering. While a well-designed UI/UX might be appreciated, the candidate should include software development projects, even small ones, to demonstrate coding skills and experience. This could be personal projects, contributions to open-source projects, or coursework-related assignments. If no software projects exist, then the candidate should create some to improve the CV."
  },
  {
    "text": "Language:",
    "page": 2,
    "x": 36,
    "y": 426.37,
    "width": 44.41,
    "height": 12.31,
    "description": "Listing spoken languages is good, but it doesn't relate directly to software engineering skills. It is important to have technical skill set in the CV. This section is fine, but it shouldn't be prioritized over essential programming skills and experiences related to software development."
  }
]