[
  {
    "text": "EDUCATION",
    "page": 1,
    "x": 36,
    "y": 106.69,
    "width": 59.11,
    "height": 12.31,
    "description": "While education is important, it currently highlights a Bachelor of Fine Arts, which is not directly relevant to an account executive role. To improve, consider adding relevant coursework or skills gained that are transferable, such as communication, project management, or business acumen.",
    "type": "weak"
  },
  {
    "text": "AWARDS",
    "page": 1,
    "x": 288,
    "y": 106.69,
    "width": 69.16,
    "height": 12.31,
    "description": "While awards are good to have, these are design related and not directly relevant to the job of account executive. Consider omitting these to save space for more relevant experiences or skills.",
    "type": "weak"
  },
  {
    "text": "EXPERIENCES",
    "page": 1,
    "x": 36,
    "y": 205.33,
    "width": 66.57,
    "height": 12.31,
    "description": "The experiences section contains some experiences that are less related to account executive and some can be improved. For example, the American Advertising Federation's description could be improved with more sales-related skills such as increasing event attendance.",
    "type": "weak"
  },
  {
    "text": "Vietnamese Student Association",
    "page": 1,
    "x": 603.25,
    "y": 36,
    "width": 148,
    "height": 12.31,
    "description": "The experience as Vice-President of the Vietnamese Student Association can be improved by adding quantifible results and sales related skills. The current description focuses primarily on event planning and leadership but doens't mention business outcomes.",
    "type": "weak"
  },
  {
    "text": "https://www.linkedin.com/in/ca-nguyen-site2001/",
    "page": 1,
    "x": 277.69,
    "y": 69.97,
    "width": 214.8,
    "height": 12.31,
    "description": "Including a LinkedIn profile is strong because it allows recruiters to easily find more information about the candidate's experience and network.",
    "type": "strong"
  },
  {
    "text": "Collaborated e`ectively with organizers and volunteers to seamlessly execute design elements, contributing to the",
    "page": 1,
    "x": 72,
    "y": 329.89,
    "width": 491.27,
    "height": 12.31,
    "description": "The ability to collaborate effectively is crucial for an account executive, as it involves working with internal teams and clients. This shows teamwork and communication skills.",
    "type": "strong"
  },
  {
    "text": "Spearheaded event planning initiatives, leveraging organizational and creative prowess.",
    "page": 1,
    "x": 72,
    "y": 628.21,
    "width": 374.86,
    "height": 12.31,
    "description": "Leading event planning showcases organizational skills and the ability to take initiative, which are valuable for an account executive in managing projects and clients.",
    "type": "strong"
  },
  {
    "text": "Adobe Illustrator, Adobe Photoshop, Adobe InDesign, Adobe XD, Figma, Microsoft O`ice",
    "page": 2,
    "x": 77.29,
    "y": 402.13,
    "width": 380.67,
    "height": 12.31,
    "description": "Listing design software skills is strong because it shows proficiency in tools that might be used to support account activities like creating presentations or marketing materials, even if the role isn't primarily design-focused.",
    "type": "strong"
  }
]